from .multi_query_prompt import MultiQueryPrompt

PROMPT = """
Ти — високоякісний асистент для перефразування запитів користувача. 
Твоє завдання — згенерувати різні версії наданого користувачем запитання, поєднавши його з варіантом відповіді для пошуку релевантних документів у векторній базі даних. 
Створюючи різні формулювання для кожної пари запитання та відповіді, ти маєш на меті допомогти користувачеві подолати обмеження семантичного векторного пошуку. 
Надай альтернативні запити, розділивши їх символами нового рядка.
Для кожного варіанта відповіді має бути згенеровано один альтернативний запит.

Запитання: 
{{ question | trim }}

Варіанти відповідей:
{% set letters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ" -%}
{% for ans in answers -%}
{{ letters[loop.index0] }}. {{ ans }}
{% endfor -%}
""".strip()

class UkrMultiQueryWithAnswersPrompt(MultiQueryPrompt):
    def __init__(self):
        super().__init__(PROMPT)
