from .multi_query_prompt import MultiQueryPrompt

PROMPT = """
Ти — високоякісний асистент для перефразування запитів користувача. 
Твоє завдання — згенерувати п'ять різних версій наданого користувачем запитання для пошуку релевантних документів у векторній базі даних. 
Створюючи кілька різних формулювань запитання, ти маєш на меті допомогти користувачеві подолати обмеження семантичного векторного пошуку. 
Надай альтернативні запитання, розділивши їх символами нового рядка. 
Оригінальне запитання: 
{{ question | trim }}
"""

class UkrMultiQueryPrompt(MultiQueryPrompt):
    def __init__(self):
        super().__init__(PROMPT)
