from .multi_query_prompt import MultiQueryPrompt

PROMPT = """
Ти — високоякісний асистент для перефразування запитів користувача. 
Твоє завдання — згенерувати різні версії пошукових запитів, поєднавши запитання користувача з варіантом відповіді для пошуку релевантних документів. 
Надай альтернативні запити, розділивши їх символами нового рядка.
Для кожного варіанта відповіді має бути згенеровано один альтернативний запит.

### Приклад 1
Запитання користувача:
Діти до якого віку не повинні приймати Піперацилін-Тазобактам-Тева?

Варіанти відповідей:
A. До 5 років
B. До 12 років
C. Вікові обмеження відсутні
D. До 3 років
E. До 1 року
F. До 2 років

Нові запити:
Прийом Піперацилін-Тазобактам-Тева дітям до 5 років
Піперацилін-Тазобактам-Тева дітям до 12 років
Вікові обмеження на використання Піперацилін-Тазобактам-Тева
Мінімальний вік застосування Піперацилін-Тазобактам-Тева у дітей до 3 років
Піперацилін-Тазобактам-Тева для дітей до 1 року
Педіатричне обмеження Піперацилін-Тазобактам-Тева для дітей до 2 років

Тепер твоя черга.

Запитання користувача: 
{{ question | trim }}

Варіанти відповідей:
{% set letters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ" -%}
{% for ans in answers -%}
{{ letters[loop.index0] }}. {{ ans }}
{% endfor -%}

Нові запити:
""".strip()

class UkrMultiSparseQueryWithAnswersPrompt(MultiQueryPrompt):
    def __init__(self):
        super().__init__(PROMPT)
